README.html
<!DOCTYPE html>
<html>
<head>
<title>Xtools package</title>
<!-- 2015-12-19 六 11:49 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="ZGUANG@LZU">
</head>
<body>
<div id="content">
<h1 class="title">Xtools package</h1>
<p>
The <b>Xtools</b> package contains some R functions often use in our lab.
</p>
<p>
You can use it freely.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Install</h2>
<div class="outline-text-2" id="text-1">
<p>
The package can be install with <b>devtools</b> from <b>github</b> by execute the following commands in R:
</p>
<div style="border:1px solid gray"><div><div style="padding: 0 1em;  border:solid 1px #F7F7F7; background-color: #fff4e8;"><pre class="knitr r"><span style="color: #ff5050;">## install.packages('devtools')</span>
<span style="color: #990000;">require</span><span style="color: #404040;">(devtools)</span>
<span style="color: #990000;">install_github</span><span style="color: #404040;">(</span><span style="color: #00884c;">&quot;zgzhao/Xtools&quot;</span><span style="color: #404040;">)</span>
</pre></div>
</div></div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Using LT50s shiny app</h2>
<div class="outline-text-2" id="text-2">
<p>
After <b>Xtools</b> installation, you can use the shiny app as:
</p>
<div style="border:1px solid gray"><div><div style="padding: 0 1em;  border:solid 1px #F7F7F7; background-color: #fff4e8;"><pre class="knitr r"><span style="color: #990000;">require</span><span style="color: #404040;">(shiny)</span>
<span style="color: #404040;">xpp</span> <span style="color: #b06c58;">&lt;-</span> <span style="color: #990000;">system.file</span><span style="color: #404040;">(</span><span style="color: #00884c;">&quot;examples&quot;</span><span style="color: #404040;">,</span> <span style="color: #00884c;">&quot;LT50s&quot;</span><span style="color: #404040;">,</span> <span style="color: #30a188;">package</span> <span style="color: #404040;">=</span> <span style="color: #00884c;">&quot;Xtools&quot;</span><span style="color: #404040;">)</span>
<span style="color: #990000;">runApp</span><span style="color: #404040;">(xpp)</span>
</pre></div>
</div></div>
<p>
Or:
</p>
<div style="border:1px solid gray"><div><div style="padding: 0 1em;  border:solid 1px #F7F7F7; background-color: #fff4e8;"><pre class="knitr r"><span style="color: #990000;">require</span><span style="color: #404040;">(Xtools)</span>
<span style="color: #990000;">LT50s.shiny.app</span><span style="color: #404040;">()</span>
</pre></div>
</div></div>
<p>
Both methods do the same things.
</p>
<hr >
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#20316;&#32773;: ZGUANG@LZU</p>
<p class="date">Created: 2015-12-19 六 11:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"></p>
</div>
</body>
</html>
